### Data Cleaning

In [1]:
from sqlalchemy import create_engine
import pandas as pd

In [2]:
sqlitedb_path = '/home/juan/IronHack/ih_datamadpt0420_project_m1/data/raw_data_project_m1.db'

In [3]:
engine = create_engine(f'sqlite:///{sqlitedb_path}')

In [16]:
# list all tables in database
pd.read_sql_query("SELECT name FROM sqlite_master WHERE type='table'", engine)

            name
0  personal_info
1   country_info
2    career_info
3      poll_info

### Career Info

In [23]:
# query one of them
df_career = pd.read_sql_query("select * from career_info", engine)

df_career.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9649 entries, 0 to 9648
Data columns (total 4 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   uuid                 9649 non-null   object
 1   dem_education_level  8986 non-null   object
 2   dem_full_time_job    9649 non-null   object
 3   normalized_job_code  5702 non-null   object
dtypes: object(4)
memory usage: 301.7+ KB

In [24]:
df_career['normalized_job_code']

0                                   None
1       861a9b9151e11362eb3c77ca914172d0
2                                   None
3       049a3f3a2b5f85cb2971ba77ad66e10c
4       f4b2fb1aa40f661488e2782b6d57ad2f
                      ...
9644    847165cfda6b1dc82ae22b967da8af2f
9645    a4d5b8b38f9513825d0d94a981ebe962
9646                                None
9647    775190277a849cba701b306a7b374c0a
9648    8a7a3f1bce0958ae9f090683e5a925b7
Name: normalized_job_code, Length: 9649, dtype: object

In [25]:
x = pd.unique(df_career['normalized_job_code'])
len(x)

157

In [41]:
df_career.isnull().sum()

uuid                      0
dem_education_level     663
dem_full_time_job         0
normalized_job_code    3947
dtype: int64

In [42]:
df_career['normalized_job_code'].value_counts().sort_index()

004431b0c1ce29ff6145307fa23f3f98    15
0044971fda4a261b6049a63817913e95    11
00bff17fca67555d8d86e8ead86dcd70    22
022d0e3a40aa3e29bca6851542b27842     9
02e4c028f64f176de2f54bbc2f5403ce    15
                                    ..
f6fbd9dea1fa8f899683ade8e7d87d60    10
f842344417ed2fc226d9cc00f9562458    12
f8984e50675cf61e5ac1ea8f661e0ab2    16
fcaf4aac737e53ad24b9f32f08b8740f    88
fd69391dc29c83d5ad744daa57de0175    14
Name: normalized_job_code, Length: 156, dtype: int64

### Personal Info

In [33]:
df_personal = pd.read_sql_query("select * from personal_info", engine)

df_personal.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9649 entries, 0 to 9648
Data columns (total 5 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   uuid              9649 non-null   object
 1   age               9649 non-null   object
 2   gender            9649 non-null   object
 3   dem_has_children  9649 non-null   object
 4   age_group         9649 non-null   object
dtypes: object(5)
memory usage: 377.0+ KB

In [35]:
df_personal.head()

,uuid,age,gender,dem_has_children,age_group
0,f6e7ee00-deac-0133-4de8-0a81e8b09a82,61 years old,male,NO,40_65
1,54f0f1c0-dda1-0133-a559-0a81e8b09a82,57 years old,male,yES,40_65
2,83127080-da3d-0133-c74f-0a81e8b09a82,32 years old,male,nO,26_39
3,15626d40-db13-0133-ea5c-0a81e8b09a82,45 years old,Male,YES,40_65
4,24954a70-db98-0133-4a64-0a81e8b09a82,41 years old,Fem,yES,40_65

In [39]:
df_personal['gender'].unique()

array(['male', 'Male', 'Fem', 'FeMale', 'female'], dtype=object)

In [ ]:
def gender():
    df.

In [38]:
df_personal['age'].unique()

array(['61 years old', '57 years old', '32 years old', '45 years old',
       '41 years old', '1990', '47 years old', '34 years old', '1994',
       '49 years old', '58 years old', '1991', '40 years old',
       '37 years old', '48 years old', '31 years old', '1999', '1989',
       '2001', '35 years old', '51 years old', '1988', '42 years old',
       '33 years old', '64 years old', '38 years old', '55 years old',
       '1992', '1993', '36 years old', '46 years old', '1998',
       '44 years old', '1996', '65 years old', '1995', '52 years old',
       '2002', '50 years old', '1997', '43 years old', '1987', '1986',
       '39 years old', '53 years old', '62 years old', '2000',
       '54 years old', '56 years old', '59 years old', '60 years old',
       '63 years old'], dtype=object)

### Country Info

In [28]:
df_country = pd.read_sql_query("select * from country_info", engine)

df_country.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9649 entries, 0 to 9648
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   uuid          9649 non-null   object
 1   country_code  9649 non-null   object
 2   rural         9649 non-null   object
dtypes: object(3)
memory usage: 226.3+ KB

In [32]:
df_country['country_code'].unique()

array(['AT', 'BE', 'BG', 'CY', 'CZ', 'DE', 'DK', 'EE', 'ES', 'FI', 'FR',
       'GB', 'GR', 'HR', 'HU', 'IE', 'IT', 'LT', 'LU', 'LV', 'MT', 'NL',
       'PL', 'PT', 'RO', 'SE', 'SI', 'SK'], dtype=object)

### Poll Info

In [40]:
df_poll = pd.read_sql_query("select * from poll_info", engine)

df_poll.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9649 entries, 0 to 9648
Data columns (total 6 columns):
 #   Column                                               Non-Null Count  Dtype
---  ------                                               --------------  -----
 0   uuid                                                 9649 non-null   object
 1   question_bbi_2016wave4_basicincome_awareness         9649 non-null   object
 2   question_bbi_2016wave4_basicincome_vote              9649 non-null   object
 3   question_bbi_2016wave4_basicincome_effect            9649 non-null   object
 4   question_bbi_2016wave4_basicincome_argumentsfor      9649 non-null   object
 5   question_bbi_2016wave4_basicincome_argumentsagainst  9649 non-null   object
dtypes: object(6)
memory usage: 452.4+ KB